              03 ELEMENT.
              05 ELEMENT1 PIC 9(12) .
              05 ELEMENT2 PIC 9(12) .
              05 ELEMENT3 PICTURE IS XXXX9999(12).
